OPF_MARKERS = [
    # Релігійні
    (825, "Релігійна організація", [
        "релігійна громада",
        "парафія",
        "церкв",
        "монастир",
        "єпарх",
    ]),

    # Профспілки
    (830, "Профспілка", [
        "профспілк",
        "первинна профспілкова",
    ]),

    # ОСББ
    (855, "Об’єднання співвласників багатоквартирного будинку", [
        "об'єднання співвласників",
        "осбб",
    ]),

    # Благодійні
    (845, "Благодійна організація", [
        "благодійний фонд",
        "благодійна організація",
    ]),

    # Громадські
    (815, "Громадська організація", [
        "громадська організація",
        "громадське об'єднання",
    ]),
]



def extract_opf(full_name_norm, opf_ref):
    # --- PASS 1: точний OPF ---
    for _, r in opf_ref.iterrows():
        if full_name_norm.startswith(r["OPF_NAME_NORM"]):
            return r["OPF_CODE"], r["OPF_NAME"]

    # --- PASS 2: семантичні маркери ---
    for code, name, markers in OPF_MARKERS:
        for m in markers:
            if m in full_name_norm:
                return code, name

    return None, None
