MICRO_SUCCESS = {
    "Рахунок відкрито",
    "Відкриття рахунку"
}

MICRO_IN_PROGRESS = {
    "В роботі",
    "Необхідно подумати",
    "Передано на RM",
    "Зустріч на відділені"
}

MICRO_FAILED = {
    "Відмова",
    "Новий",
    "Неактуальні контактні дані",
    "Недодзвон"
}


SMALL_SUCCESS = {
    "Відкриття рахунку"
}

SMALL_IN_PROGRESS = {
    "Клієнт зацікавлений",
    "Клієнт зацікавлений. Потрібен дзвінок/зустріч з RM",
    "Консультацію не проведено. Потрібен додатковий дзвінок",
    "Консультацію проведено. Потрібен додатковий дзвінок",
    "Консультацію проведено"
}

SMALL_FAILED = {
    "Консультацію проведено. Відмова клієнта",
    "Консультацію проведено, відмова клієнта",
    "Клієнт не зацікавлений",
    "Клієнт відмовився від зустрічі",
    "Відмова клієнта",

    "Неможливо зв'язатись з клієнтом. Номер телефону недійсний",
    "Неможливо зв'язатись з клієнтом. Не відповідає на дзвінок",
    "Неможливо дізнатись актуальну Контактну особу клієнта",

    "Не актуальні контактні дані",
    "Контакт не актуальний",

    "Консультацію проведено. Не відповідає сегментації.",

    "Відмова OTP Банку (framework)",
    "Відмова OTP Банку (фін.моніторинг)",
    "Відмова OTP Банку (Клієнт не відповідає вимогам)",
    "Відмова OTP Банку (фін. стан)",
    "Відмова OTP Банку (Бенефіціар – громадянин РФ)",

    "Виконано",
    "Виконано з помилками"
}